Revit 2024 API
AnalysisDisplayStyle.FindByName Method
 Finds analysis display style by name.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public static ElementId FindByName(
	Document document,
	string name
)
Visual Basic
Public Shared Function FindByName ( _
	document As Document, _
	name As String _
) As ElementId
Visual C++
public:
static ElementId^ FindByName(
	Document^ document,
	String^ name
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 Document in which to look for analysis display style element.
name
Type: System.String
 Name of analysis display style to look for.
Return Value
 Element id of the found analysis display style, invalidElementId if not found.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
AnalysisDisplayStyle Class
Autodesk.Revit.DB.Analysis Namespace